export const auth = {
  errors: {
    invalidData: "Получены неверные данные аутентификации",
    loginFailed: "Ошибка входа",
    logoutError: "Ошибка при выходе: {{error}}",
    authError: "Ошибка при обработке аутентификации {{error}}",
    getTokenError: "Ошибка при получении токена обновления:",
    setTokenError: "Ошибка при сохранении токена обновления:",
    removeTokenError: "Ошибка при удалении токена обновления:",
    emptyToken: "Попытка сохранить пустой токен обновления"
  },
  success: {
    login: "Вход выполнен успешно!",
    logout: "Выход выполнен успешно!"
  }
}; 